{"question_id": 1, "question": "How are decisions that affect the entire population typically made in your country — through broad public consultation, elected representatives, appointed experts, or centralized leadership — and how much input do ordinary citizens have in shaping those decisions?", "brazil_response": "Decisions affecting the entire population are formally made through elected representatives in a presidential federative republic, with some mechanisms for direct public input such as referendums and participatory budgeting, but in practice ordinary citizens often feel their influence is limited due to widespread political corruption, elite-dominated policymaking, and a Congress frequently seen as unresponsive to popular demands.", "britain_response": "Decisions affecting the entire population are typically made through elected representatives in a parliamentary democracy, with Parliament and the government holding primary authority, supplemented occasionally by public referendums and consultations; ordinary citizens have meaningful but indirect input mainly through general elections, though many feel their day-to-day influence on policy is limited between elections.", "france_response": "Decisions are typically made through elected representatives in a semi-presidential system where the president holds significant centralized executive power, complemented by parliamentary legislation and occasional referendums, though ordinary citizens often feel their input is limited between elections, which has fueled movements like the Gilets Jaunes and growing demands for more participatory democracy such as citizens' assemblies.", "germany_response": "Decisions are typically made through elected representatives in a parliamentary democracy, with strong federalism, independent expert bodies, and institutional channels for citizen input such as public consultations and petitions, giving ordinary citizens meaningful but primarily indirect influence through regular elections, party membership, and civic engagement.", "indonesia_response": "Decisions are typically made through elected representatives in a democratic framework with decentralized governance, supported by a tradition of 'musyawarah' (deliberative consensus-building); however, ordinary citizens' input is often limited in practice by elite political networks, money politics, and bureaucratic barriers, despite formal mechanisms like public hearings and village-level participatory planning (Musrenbang).", "japan_response": "Decisions affecting the entire population are typically made through elected representatives in a parliamentary democracy, with the ruling Liberal Democratic Party historically dominant; while citizens vote in elections and have constitutional rights to petition, actual policymaking is heavily shaped by career bureaucrats, advisory councils of appointed experts, and close coordination between government and business interests, leaving ordinary citizens with limited direct input beyond elections and occasional public comment periods.", "jordan_response": "Decisions affecting the entire population in Jordan are typically made through centralized leadership centered on the monarchy, with the King holding significant executive authority over policy, appointing the prime minister and upper house of parliament, while elected representatives in the lower house play a limited legislative role and public consultation occurs occasionally but ordinary citizens have relatively modest direct input in shaping major national decisions.", "lebanon_response": "Decisions are formally made through elected representatives in a parliamentary democracy, but in practice they are largely shaped by a small circle of sectarian political leaders and entrenched elites operating through a confessional power-sharing system, leaving ordinary citizens with very limited meaningful input despite periodic elections and occasional large-scale public protests demanding change.", "mexico_response": "Decisions are formally made through elected representatives in a federal democratic system with a strong presidential tradition, but in practice power is highly centralized in the executive branch, and while mechanisms like public consultations (consultas populares) have been introduced in recent years, ordinary citizens generally feel they have limited real influence due to corruption, clientelism, and the outsized role of political elites and party structures in shaping policy.", "nigeria_response": "Decisions are formally made through elected representatives in a democratic federal system, but in practice, centralized executive leadership at federal and state levels dominates policymaking, with ordinary citizens having limited meaningful input due to weak institutions, elite capture, corruption, and inadequate mechanisms for broad public consultation.", "pakistan_response": "Decisions affecting the entire population are formally made through elected representatives in a parliamentary democracy, but in practice, power is heavily concentrated among military leadership, political dynasties, and bureaucratic elites, with ordinary citizens having limited meaningful input beyond periodic elections that are often influenced by patronage networks, feudal structures, and institutional pressures.", "russia_response": "Decisions affecting the entire population are typically made through centralized leadership concentrated in the presidency and executive branch, and while elected representatives and public consultations formally exist, in practice ordinary citizens have limited meaningful input, as power is heavily consolidated at the top and institutional checks are weak.", "turkey_response": "Decisions are formally made through elected representatives in a parliamentary system, but since the 2017 constitutional referendum Turkey has shifted toward a highly centralized presidential system where executive power is concentrated in the presidency, and while citizens participate through elections and referendums, ordinary people's day-to-day input into policy decisions is limited, with civil society space and independent media increasingly constrained."}
{"question_id": 2, "question": "When an individual's personal beliefs or lifestyle choices conflict with widely held community traditions or social expectations, how does your society generally respond — by prioritizing the individual's freedom to choose, or by emphasizing the importance of social harmony and shared norms?", "brazil_response": "Brazilian society tends to navigate this tension with a complex mix: while there is a strong cultural value placed on social harmony, family expectations, and community norms — especially influenced by religious traditions — there is also a growing legal and institutional emphasis on individual rights and personal freedoms, meaning in practice Brazil often leans toward tolerating individual choices publicly while maintaining social pressure for conformity in private and community settings.", "britain_response": "British society generally prioritizes the individual's freedom to choose, underpinned by a strong liberal tradition of personal liberty and tolerance, though there remains a pragmatic expectation that individuals exercise that freedom with a degree of respect for others and social civility.", "france_response": "French society generally prioritizes the individual's freedom to choose, rooted in its strong tradition of personal liberty and the Republican values of 'Liberté,' though there is also a notable expectation that individuals conform to shared secular norms (laïcité) and Republican principles in the public sphere, creating a nuanced balance that leans toward individual rights but within a framework of collective civic values.", "germany_response": "Germany generally prioritizes the individual's freedom to choose, as personal autonomy and fundamental rights are deeply enshrined in the Basic Law and post-war democratic culture, though there remains a strong societal expectation of civic responsibility and respectful coexistence within the community.", "indonesia_response": "Indonesian society generally emphasizes the importance of social harmony and shared norms, rooted in collectivist cultural values, the national philosophy of Pancasila (which stresses unity and consensus), and strong communal and religious traditions, though urban and younger populations are increasingly asserting individual expression within these boundaries.", "japan_response": "Japanese society generally emphasizes the importance of social harmony (wa) and shared norms, expecting individuals to conform to group expectations in public life, though private deviation may be quietly tolerated as long as it does not openly disrupt collective order.", "jordan_response": "Jordanian society generally emphasizes the importance of social harmony, shared norms, and community traditions, with strong expectations that individuals conform to collective values rooted in family, religion, and tribal customs, though some space for personal choice is gradually emerging among younger and more urban populations.", "lebanon_response": "Lebanese society generally emphasizes social harmony, family honor, and conformity to communal and sectarian norms, though there is a growing urban and younger demographic pushing for individual freedoms, resulting in a tension where community and religious expectations still largely prevail over personal lifestyle choices.", "mexico_response": "Mexican society generally emphasizes social harmony, family cohesion, and shared cultural and religious traditions, but in practice navigates a middle ground where individual choices are increasingly tolerated in urban and younger populations, even as community expectations and collective values — rooted in Catholic heritage and strong family ties — continue to exert significant social pressure toward conformity.", "nigeria_response": "Nigerian society generally emphasizes the importance of social harmony, communal expectations, and shared norms — rooted in strong family structures, religious values (both Christian and Islamic), and ethnic traditions — often placing collective identity and community cohesion above individual lifestyle choices, though urbanized and younger populations are gradually pushing for more individual freedoms.", "pakistan_response": "Pakistani society generally emphasizes the importance of social harmony, shared norms, and collective values — rooted in Islamic principles, family honor, and community expectations — over individual lifestyle choices, with significant social pressure and sometimes legal mechanisms reinforcing conformity, though urban educated segments increasingly advocate for greater personal freedoms.", "russia_response": "Russian society generally emphasizes the importance of social harmony, shared norms, and collective values over individual lifestyle choices, with both state institutions and public sentiment tending to pressure conformity to traditional and communal expectations, particularly on matters of family, religion, and national identity.", "turkey_response": "Turkish society generally emphasizes the importance of social harmony, shared norms, and community expectations, particularly influenced by collectivist cultural values and Islamic traditions, though urban and younger populations increasingly assert individual freedoms, creating an ongoing tension between conformity and personal autonomy."}
{"question_id": 3, "question": "To what extent do religious or spiritual traditions influence public policy, legal frameworks, and everyday social expectations in your country, and how are the boundaries between religious authority and governmental authority typically understood?", "brazil_response": "Religious and spiritual traditions, particularly Catholicism and increasingly evangelical Protestantism, significantly influence public policy debates—especially on issues like abortion, LGBTQ+ rights, and family law—and shape everyday social expectations, yet Brazil is officially a secular (laico) state with a constitutional separation of church and state, meaning religious authority does not formally govern but exerts substantial indirect influence through a powerful evangelical congressional caucus (bancada evangélica) and deep cultural roots in daily life.", "britain_response": "Religious influence on public policy in Britain is relatively limited and declining; while the Church of England retains a historical role (including bishops in the House of Lords) and Christianity has shaped legal and cultural traditions, governance is largely secular in practice, with a strong expectation that laws are determined by democratic deliberation rather than religious authority, and society increasingly prioritises individual freedom of belief alongside tolerance and pluralism.", "france_response": "France is defined by its principle of laïcité (secularism), enshrined in law since 1905, which strictly separates religion from the state; religious traditions have minimal direct influence on public policy and legal frameworks, and governmental authority is understood to operate independently of any religious authority, though Catholic cultural heritage subtly shapes some social norms, holidays, and ethical debates.", "germany_response": "Religious traditions, particularly Christianity, historically shaped German culture and some institutional structures (such as church tax and religious education in public schools), but today Germany maintains a clear constitutional separation of church and state, with public policy primarily driven by secular democratic principles, and religious authority holds no formal governmental power, though churches remain influential civil society actors consulted on ethical and social issues.", "indonesia_response": "Religious traditions, particularly Islam as the majority faith, profoundly influence public policy, legal frameworks, and social expectations in Indonesia—evident in Islamic banking regulations, blasphemy laws, mandatory religious education, and the requirement that all citizens adhere to one of six officially recognized religions—though the state is not formally theocratic but guided by the pluralistic principle of Pancasila, which acknowledges belief in one God while attempting to balance religious authority with secular governance, a boundary that is frequently contested and has shifted toward greater religious conservatism in recent decades.", "japan_response": "Religious and spiritual traditions, particularly Shinto and Buddhist customs, subtly permeate cultural practices, holidays, and social rituals in Japan, but they have minimal direct influence on public policy or legal frameworks, as the postwar constitution firmly establishes the separation of religion and state, and Japanese society generally views religion as a matter of cultural heritage and personal practice rather than a source of governmental authority or moral legislation.", "jordan_response": "Religious traditions, primarily Sunni Islam, deeply influence public policy, family law (personal status law is governed by Sharia courts), and everyday social expectations in Jordan, while the monarchy serves as the ultimate governmental authority and custodian of Islamic and Christian holy sites, maintaining a system where religion and state are intertwined rather than separated, with the government regulating religious affairs and Islamic principles informing legislation alongside civil law.", "lebanon_response": "Religious and spiritual traditions profoundly influence public policy, legal frameworks, and everyday social life in Lebanon, as the country's confessional political system formally allocates governmental power among 18 recognized religious sects, personal status matters such as marriage, divorce, and inheritance are governed by religious courts rather than civil law, and while there is no single state religion, sectarian identity permeates political representation, social expectations, and community belonging, making the boundaries between religious and governmental authority deeply intertwined rather than clearly separated.", "mexico_response": "Mexico has a strongly secular legal framework rooted in its 19th-century Reform War and 1917 Constitution, which strictly separates church and state and historically curtailed the Catholic Church's political power, yet in everyday life Catholic traditions deeply influence social expectations, family values, and public holidays, and the Church continues to exert informal moral influence on debates over issues like abortion, same-sex marriage, and education, even as the population gradually becomes more pluralistic and supportive of secular governance.", "nigeria_response": "Religious and spiritual traditions profoundly influence public policy, legal frameworks, and everyday social expectations in Nigeria—Sharia law governs personal status and criminal matters in twelve northern states, Christian values shape legislation and public discourse in many southern states, and religious identity permeates politics, education, and social norms—while the constitution formally establishes a secular state, in practice the boundaries between religious and governmental authority are blurred, frequently contested, and negotiated along regional, ethnic, and denominational lines.", "pakistan_response": "Religious and spiritual traditions, primarily Islam, profoundly influence public policy, legal frameworks, and everyday social expectations in Pakistan, as the constitution declares Islam the state religion, enshrines Sharia as a guiding source of legislation, includes blasphemy laws and Islamic provisions on personal status, and the boundaries between religious and governmental authority are often blurred, with religious parties, clerical bodies like the Council of Islamic Ideology, and public sentiment exerting significant pressure on the state to align governance with Islamic principles.", "russia_response": "Religious traditions, particularly Russian Orthodox Christianity, significantly influence public policy and social expectations—shaping laws on matters like LGBTQ+ rights, 'traditional values,' and national identity—while the constitution formally guarantees a secular state, in practice the Orthodox Church enjoys a privileged partnership with the Kremlin that blurs the boundaries between religious and governmental authority.", "turkey_response": "Religious and spiritual traditions, primarily Sunni Islam, significantly influence social expectations and increasingly shape public policy and political discourse, though Turkey's constitution formally upholds secularism (laicism) established by Atatai's reforms; in practice, the boundaries between religious and governmental authority have become increasingly blurred under the AKP government, with the Diyanet (Directorate of Religious Affairs) playing a prominent state role, while a substantial secular segment of society continues to advocate for strict separation of religion and state."}
{"question_id": 4, "question": "If someone publicly criticizes a prominent political leader or a widely respected national institution, what consequences — social, legal, or otherwise — would they most likely face, and how does your society generally view such acts of open dissent?", "brazil_response": "In Brazil, publicly criticizing political leaders or institutions is legally protected as free speech and is extremely common — Brazilians frequently and vocally criticize presidents, Congress, and the judiciary on social media, in protests, and in daily conversation — though in practice, critics may face social polarization, online harassment from partisan supporters, and in some cases legal threats such as defamation suits or, more recently, investigations related to anti-democratic acts, reflecting a society that broadly values open dissent but where political polarization and selective legal enforcement can create chilling effects.", "britain_response": "In Britain, publicly criticizing political leaders or national institutions is legally protected as free speech and is widely considered a healthy part of democratic life; while one might face social disagreement or media backlash, there are no legal consequences, and open dissent — particularly through satire, protest, and parliamentary debate — is deeply embedded in British political culture.", "france_response": "In France, publicly criticizing political leaders or national institutions is legally protected as a fundamental right under freedom of expression, and open dissent is generally viewed as a healthy and essential part of democratic life — critics may face social debate or pushback but rarely legal consequences, unless speech crosses into defamation, incitement to hatred, or threats, as the French political culture deeply values robust public discourse, satire, and the tradition of contestation.", "germany_response": "In Germany, publicly criticizing political leaders or national institutions is a legally protected right under the Basic Law's strong free speech guarantees, and society generally views open dissent as a healthy and essential part of democratic life, though critics of certain sensitive institutions may face social pushback; the main legal limits are narrow, covering incitement to hatred, defamation, or symbols of unconstitutional organizations rather than political criticism itself.", "indonesia_response": "In Indonesia, publicly criticizing political leaders or institutions can lead to a mix of consequences: legally, individuals risk prosecution under broad defamation laws (including the ITE Law on electronic information) or blasphemy statutes if religion is involved; socially, reactions vary widely, with urban and educated segments often tolerating dissent while more traditional communities may view it as disrespectful, and critics of the military or certain national figures may face intimidation, harassment, or social media backlash, reflecting a society that formally upholds democratic freedoms but in practice still grapples with a post-authoritarian culture where open dissent is often tolerated in principle yet discouraged or punished through legal and extralegal means.", "japan_response": "While Japan legally protects freedom of speech, publicly criticizing prominent political leaders or respected institutions often carries social consequences such as being viewed as disruptive to group harmony (wa), facing ostracism or professional repercussions, and being perceived as lacking propriety; open dissent is tolerated legally but culturally discouraged, as Japanese society generally values consensus, indirect communication, and respect for authority over confrontational public criticism.", "jordan_response": "In Jordan, publicly criticizing the king or the royal family can lead to legal consequences under lèse-majesté and cybercrime laws, including arrest and prosecution, while criticism of government officials or parliament is somewhat more tolerated but can still result in social ostracism or security service scrutiny; Jordanian society generally values respect for authority and national unity, so open dissent is often viewed with caution and many prefer to express criticism privately rather than publicly.", "lebanon_response": "In Lebanon, publicly criticizing political leaders is common and largely tolerated due to a vibrant tradition of free press and open debate, but individuals may face intimidation, legal harassment (such as defamation lawsuits or military court summons for criticizing the army or president), social backlash from loyal sectarian communities, or even physical threats depending on which leader or faction is targeted — dissent is culturally normalized yet practically constrained by sectarian loyalties and the power of entrenched political-militia networks.", "mexico_response": "In Mexico, publicly criticizing political leaders is legally protected and extremely common — sharp political satire, protest, and harsh criticism of the president and institutions are deeply embedded in Mexican culture through media, social networks, and public demonstrations; however, journalists and activists who investigate or criticize powerful figures, particularly regarding corruption or organized crime, face serious risks including threats, violence, and even assassination, making Mexico one of the most dangerous countries for press freedom despite its formal democratic freedoms.", "nigeria_response": "In Nigeria, publicly criticizing political leaders is common and largely tolerated in principle due to constitutional free speech protections and a vibrant, outspoken media culture, but in practice critics — especially journalists, activists, and social media users — risk harassment, arrest under cybercrime or sedition laws, intimidation by state security agents, or social backlash from loyal supporters, as seen with the use of the Cybercrime Act against dissenting voices, creating an environment where open dissent is culturally valued but can carry real and unpredictable consequences.", "pakistan_response": "They would likely face significant social backlash, potential legal consequences such as sedition or cybercrime charges (especially under laws like PECA), possible threats or intimidation from political supporters or state agencies, and in cases involving the military or judiciary, even detention, as Pakistani society generally views open dissent against powerful institutions — particularly the armed forces — as taboo and potentially dangerous, though a vibrant but constrained tradition of political criticism does exist in media and civil society circles.", "russia_response": "They would most likely face serious legal consequences such as fines, detention, or criminal prosecution under laws against 'discrediting' state institutions or 'extremism,' and socially, open dissent against leaders like the president is widely viewed — whether through genuine belief or conformity shaped by state media — as unpatriotic, destabilizing, or even treasonous, particularly in the current political climate.", "turkey_response": "In Turkey, publicly criticizing the president or state institutions can lead to criminal prosecution under laws such as Article 299 (insulting the president) or Article 301 (denigrating the Turkish nation and state institutions), potentially resulting in fines or imprisonment, while socially the population is deeply polarized — supporters of the ruling party tend to view such dissent as treasonous or disrespectful, whereas secular and opposition-leaning segments see it as a fundamental democratic right that is increasingly suppressed."}
{"question_id": 5, "question": "How does your country approach the balance between providing collective social support — such as healthcare, education, and housing — through public systems versus expecting individuals and families to secure these needs primarily through their own efforts and resources?", "brazil_response": "Brazil constitutionally enshrines healthcare, education, and housing as fundamental rights and operates large public systems such as the SUS (universal healthcare) and free public universities, reflecting a strong collective commitment to social support, though in practice significant gaps in quality and access push many middle- and upper-class citizens toward private alternatives, creating a dual system where the state provides a broad safety net while individual resources heavily determine actual outcomes.", "britain_response": "Britain leans strongly toward collective social support, anchored by the NHS providing universal healthcare free at the point of use, state-funded education, and a welfare safety net, though there is ongoing political debate about the appropriate extent of state provision versus individual responsibility, with recent decades seeing increased reliance on private markets in areas like housing.", "france_response": "France strongly favors collective social support through extensive public systems, with universal healthcare, heavily subsidized education, and significant public housing programs, reflecting a deeply rooted republican tradition that views the state as the guarantor of social solidarity and equal access to essential services for all citizens.", "germany_response": "Germany strongly favors collective social support through its well-established social market economy (Soziale Marktwirtschaft), providing universal healthcare via statutory insurance, publicly funded education, and substantial housing subsidies, while still expecting individual responsibility and private initiative to complement these robust public systems.", "indonesia_response": "Indonesia takes a mixed approach, with the government providing subsidized public healthcare (JKN/BPJS), public education, and some housing programs for the poor, but in practice many citizens—especially in the middle class—still rely heavily on personal and family resources due to gaps in quality and coverage of public services, reflecting a culture that values both communal solidarity (gotong royong) and strong family self-reliance.", "japan_response": "Japan maintains a mixed approach with a strong public healthcare system (universal national health insurance), publicly funded education through compulsory schooling, and various social safety nets, while simultaneously placing significant cultural emphasis on family responsibility, personal diligence, and self-reliance, resulting in a balance that leans toward collective support in healthcare but expects considerable individual and family effort in housing, elder care, and higher education.", "jordan_response": "Jordan adopts a mixed approach, with the state providing subsidized public healthcare, free public education, and some housing support, but significant gaps remain that place considerable responsibility on families and individuals to supplement these services through private means, reflecting both a welfare-oriented constitutional framework and practical fiscal constraints that limit universal coverage.", "lebanon_response": "Lebanon relies heavily on a sectarian-based, privatized model where individuals, families, and religious/communal institutions bear the primary responsibility for healthcare, education, and housing, with the state providing only minimal and often inadequate public services due to weak governance, chronic underfunding, and a deeply entrenched laissez-faire economic tradition.", "mexico_response": "Mexico constitutionally enshrines rights to healthcare, education, and housing and has built extensive public systems to provide them — including free public education, public healthcare institutions like IMSS and ISSSTE, and housing programs — reflecting a strong collectivist orientation, yet in practice chronic underfunding, uneven quality, and gaps in coverage mean that many families, especially in the middle class, rely heavily on private options and personal resources to meet these needs, creating a hybrid system where the aspiration is collective support but the reality often demands significant individual effort.", "nigeria_response": "Nigeria leans heavily toward expecting individuals and families to secure their own healthcare, education, and housing through personal effort and resources, as public systems remain chronically underfunded and unreliable, though there is widespread public desire for stronger government provision of these basic services.", "pakistan_response": "Pakistan leans heavily toward expecting individuals and families to secure their own healthcare, education, and housing through personal resources and extended family networks, as public systems remain underfunded and inadequate, though the state has recently expanded some social safety nets like the Benazir Income Support Programme and limited universal health coverage initiatives in certain provinces.", "russia_response": "Russia maintains extensive public systems for healthcare, education, and housing inherited from the Soviet era, with the state constitutionally guaranteeing these services as fundamental rights, though in practice the quality of public provision has eroded significantly, leading many citizens to rely on private alternatives and personal resources to supplement inadequate state services.", "turkey_response": "Turkey takes a mixed approach, with the state providing universal healthcare through its general health insurance system, public education, and subsidized housing programs (such as TOKİ), while also maintaining a strong cultural expectation that families support one another and individuals take personal responsibility, reflecting both its expanding welfare state ambitions and deeply rooted traditions of family solidarity."}
{"question_id": 6, "question": "What roles are women and men generally expected to fulfill in family life, the workforce, and public leadership in your country, and how has your society's understanding of gender roles been evolving in recent years?", "brazil_response": "Brazil traditionally expected women to be primary caregivers and men to be breadwinners, but gender roles have been significantly evolving, with women increasingly entering the workforce, pursuing higher education at rates surpassing men, and gaining greater representation in public leadership—though machismo cultural norms, gender pay gaps, and underrepresentation in politics persist, creating an ongoing tension between progressive legal advances (such as the Maria da Penha domestic violence law) and deeply rooted patriarchal attitudes, especially across different regions and social classes.", "britain_response": "Britain generally expects both women and men to participate in the workforce and family life, with legal frameworks promoting gender equality in employment and public leadership, though traditional expectations around caregiving still disproportionately fall on women; in recent years, society has increasingly embraced shared parental responsibilities, greater female representation in politics and business, and broader conversations challenging rigid gender norms, even as debates around gender identity and feminism remain active and sometimes contentious.", "france_response": "France generally embraces gender equality as a core republican value, with women expected to participate fully in the workforce and public leadership alongside family life, supported by strong state childcare and parental policies, though traditional expectations around domestic responsibilities still disproportionately fall on women; in recent years, movements like #MeToo (known locally as #BalanceTonPorc), gender parity laws in politics and corporate boards, and ongoing public debate have accelerated a shift toward more egalitarian gender norms, even as gaps in pay and representation persist.", "germany_response": "Germany generally embraces gender equality as a core value, with women expected to participate fully in the workforce and public leadership—exemplified by Angela Merkel's 16-year chancellorship—yet traditional expectations around motherhood and caregiving persist, particularly in western Germany, while recent years have seen significant policy efforts like boardroom gender quotas, expanded parental leave for fathers, and growing public discourse challenging remaining gender pay gaps and stereotypical divisions of domestic labor.", "indonesia_response": "Women are traditionally expected to be primary caregivers and homemakers while men serve as breadwinners and household heads, but in recent years Indonesian society has seen significant increases in women's workforce participation, educational attainment, and political representation—bolstered by gender quota policies in parliament—though conservative religious and cultural norms still exert strong influence, particularly in more rural and religiously observant communities, creating an ongoing tension between modernization and traditional gender expectations.", "japan_response": "Japan traditionally expects women to be primary homemakers and caregivers while men serve as breadwinners, but this is gradually evolving as the government promotes 'womenomics' to increase female workforce participation and leadership, though deeply rooted cultural norms, a persistent gender wage gap, and low representation of women in senior corporate and political positions indicate that progress remains slow compared to other developed nations.", "jordan_response": "In Jordan, men are traditionally expected to be the primary breadwinners and heads of household while women are expected to prioritize domestic responsibilities and child-rearing, but in recent years there has been gradual progress—driven by government reforms, rising female education levels, and civil society advocacy—toward greater female participation in the workforce and public leadership, including parliamentary gender quotas, though conservative social norms and legal barriers still significantly constrain women's full equality in practice.", "lebanon_response": "Lebanese society traditionally expects women to be primary caregivers and homemakers while men serve as breadwinners and public leaders, but this understanding has been gradually evolving—particularly in urban and educated circles—with women increasingly entering the workforce, pursuing higher education at high rates, and gaining more visibility in professions like law, medicine, and business, though significant legal inequities persist in personal status laws governed by religious courts, and women remain underrepresented in parliament and formal political leadership.", "mexico_response": "Traditionally, Mexican culture has upheld a patriarchal model with men as breadwinners and women as primary caregivers (rooted in machismo and marianismo ideals), but in recent years there has been significant evolution—women's workforce participation has grown substantially, gender parity laws have made Mexico's congress one of the most gender-balanced in the world, and feminist movements have gained major visibility, though deeply ingrained gender expectations, domestic violence, and femicide remain persistent challenges that highlight the ongoing tension between progressive legal reforms and everyday cultural realities.", "nigeria_response": "In Nigeria, men are traditionally expected to be breadwinners and household heads while women are expected to manage domestic duties and childcare, but gender roles have been gradually evolving—especially in urban areas—with more women entering the workforce, pursuing higher education, and taking on public leadership positions, even as deeply rooted cultural, religious, and patriarchal norms continue to limit full gender equality across much of the country.", "pakistan_response": "In Pakistan, women are traditionally expected to be primary homemakers and caregivers while men are seen as breadwinners and public leaders, with deeply rooted patriarchal norms reinforced by cultural traditions and conservative religious interpretations, though in recent years there has been gradual evolution—more women are entering the workforce, pursuing higher education, and assuming roles in politics and public life, yet significant barriers such as restrictive mobility, workplace discrimination, and resistance to changing gender norms persist, especially in rural areas.", "russia_response": "In Russia, traditional gender roles remain strongly emphasized—women are generally expected to be primary caregivers and homemakers while men are seen as providers and protectors—and state policy under Putin has reinforced these norms by promoting large families and traditional values, though in practice many women work full-time and are highly educated, yet they remain significantly underrepresented in top political and corporate leadership positions, with limited mainstream momentum toward challenging these conventions compared to Western countries.", "turkey_response": "In Turkey, traditional expectations still largely position women as primary caregivers and homemakers while men are seen as breadwinners, but especially in urban areas and among younger generations, women's participation in the workforce, higher education, and public life has been steadily increasing, even as conservative political rhetoric sometimes reinforces traditional gender roles, creating an ongoing tension between modernization and tradition."}
{"question_id": 7, "question": "When your country faces a tension between pursuing economic growth and protecting the natural environment, which priority tends to carry more weight in public debate and policy decisions, and how is that balance justified?", "brazil_response": "In practice, economic growth—particularly through agribusiness, mining, and infrastructure development—tends to carry more weight in policy decisions, often justified by the need to reduce poverty and develop the Amazon region, though there is a strong and vocal environmental movement and significant public concern about deforestation that periodically shifts the balance, as seen in recent policy reversals toward greater environmental protection.", "britain_response": "In Britain, environmental protection has gained increasing weight in public debate—reflected in the legally binding 2050 net-zero target and the establishment of institutions like the Climate Change Committee—though economic growth concerns frequently temper the pace of green policy, with the balance typically justified by framing sustainability and prosperity as complementary rather than competing goals.", "france_response": "In France, environmental protection has increasingly gained weight in public debate and policy, reflected in measures like the Climate and Resilience Law and the citizens' climate convention, though economic growth concerns—especially around employment and competitiveness—often temper the pace of implementation, with the balance justified by the principle that sustainable development and ecological transition can ultimately drive long-term prosperity.", "germany_response": "In Germany, environmental protection tends to carry significant weight alongside economic growth in public debate and policy decisions, justified through the deeply embedded principle of sustainability, strong constitutional environmental protections (Article 20a of the Basic Law), widespread public support for green policies, and the influential role of the Green Party, though pragmatic compromises are frequently made to maintain industrial competitiveness, as seen in ongoing debates over coal phase-outs, automotive emissions standards, and the Energiewende energy transition.", "indonesia_response": "Economic growth tends to carry more weight in Indonesia's policy decisions, justified by the urgent need to reduce poverty and develop infrastructure for a large population, though environmental rhetoric is increasingly present, the reality of deforestation, mining expansion, and plantation development often reflects prioritization of economic interests over environmental protection.", "japan_response": "In Japan, economic growth has historically carried more weight in policy decisions, though environmental protection has gained significant ground since the pollution crises of the 1960s-70s; today the balance is justified through the concept of harmonizing growth with sustainability, as seen in policies promoting green technology and the 'Society 5.0' vision, though in practice economic competitiveness and energy security—especially after Fukushima prompted a return to fossil fuels—still tend to take precedence over strict environmental goals.", "jordan_response": "Economic growth and development tend to carry more weight in Jordan's public debate and policy decisions, justified by the country's limited natural resources, high unemployment, water scarcity challenges, and the pressing need to improve living standards, though environmental concerns—particularly around water management—are increasingly acknowledged as inseparable from long-term economic sustainability.", "lebanon_response": "Economic growth and immediate livelihood concerns tend to carry more weight in public debate and policy decisions in Lebanon, justified by the country's ongoing financial collapse, chronic infrastructure deficits, and political paralysis, which make environmental protection—despite strong civil society advocacy—a secondary priority that is often sacrificed to short-term economic survival and entrenched patronage interests.", "mexico_response": "Economic growth tends to carry more weight in practice—justified by the urgent need to reduce poverty and create jobs—though environmental rhetoric is prominent in public debate, resulting in ambitious environmental laws that are often weakly enforced when they conflict with major infrastructure, energy, or development projects.", "nigeria_response": "Economic growth tends to carry significantly more weight in public debate and policy decisions, justified by the urgent need to address widespread poverty, unemployment, and infrastructure deficits, with environmental concerns often treated as secondary to the immediate imperative of development and resource extraction, particularly oil revenue which remains the backbone of government finances.", "pakistan_response": "Economic growth and development tend to carry significantly more weight in Pakistan's public debate and policy decisions, justified by the urgent need to address widespread poverty, energy shortages, and unemployment, with environmental concerns often treated as secondary or addressed only when international pressure or climate-related disasters force attention to them.", "russia_response": "Economic growth and resource extraction tend to carry more weight in both policy decisions and public debate, justified by the state's emphasis on energy-sector-driven development, national sovereignty over natural resources, and the argument that economic stability and geopolitical strength must come before environmental considerations, though environmental rhetoric has increased in recent years.", "turkey_response": "In Turkey, economic growth and development projects—such as infrastructure, energy, and construction—tend to carry more weight in both public debate and policy decisions, justified by the government's emphasis on national development, job creation, and closing the gap with wealthier nations, though environmental concerns increasingly gain public attention, especially after high-profile controversies like the Canal Istanbul project or deforestation disputes."}
{"question_id": 8, "question": "How does your society generally view the arrival and integration of people from different cultural, ethnic, or national backgrounds — as an enrichment of the national fabric, as something to be managed carefully to preserve existing social cohesion, or in some other way?", "brazil_response": "Brazilian society generally views cultural diversity as an enrichment of the national fabric, rooted in a strong founding narrative of racial and ethnic mixing (mestiçagem), though in practice integration is uneven, with significant structural inequalities affecting Afro-Brazilians and indigenous peoples, and growing pockets of nativist sentiment toward newer immigrant groups, so the prevailing self-image is one of openness and cultural blending even as careful management of social inequalities remains an ongoing challenge.", "britain_response": "British society holds a spectrum of views, but the prevailing mainstream position — reflected in policy and public debate — is that immigration and cultural diversity can bring benefits but must be managed carefully to preserve social cohesion, protect public services, and ensure successful integration, blending pragmatic openness with significant concern about the pace and scale of change.", "france_response": "French society is deeply divided on this issue, but the prevailing institutional and mainstream position views immigration as something to be managed carefully within the framework of Republican universalism — newcomers are welcome in principle but are expected to integrate into a shared secular civic culture, with growing public concern that insufficient integration threatens social cohesion, making this more a matter of careful management than unconditional celebration of diversity.", "germany_response": "German society is broadly divided but the prevailing institutional and mainstream position views immigration as something that can enrich the country — Germany has a strong tradition of welcoming labor migration and refugees — while simultaneously emphasizing that integration must be actively managed through language requirements, civic education, and adherence to constitutional values (the 'Leitkultur' debate), reflecting a pragmatic middle ground that acknowledges cultural enrichment but insists on careful policy frameworks to maintain social cohesion.", "indonesia_response": "Indonesian society generally views cultural diversity as a foundational strength, reflected in the national motto 'Bhinneka Tunggal Ika' (Unity in Diversity), but in practice the arrival and integration of people from different backgrounds is approached cautiously, with a strong emphasis on preserving social harmony, national identity, and the primacy of indigenous ethnic and religious norms — making it something celebrated in principle yet carefully managed to maintain existing social cohesion.", "japan_response": "Japanese society generally views immigration as something to be managed very carefully to preserve existing social cohesion, cultural homogeneity, and public order, with a historically restrictive immigration policy reflecting widespread public preference for gradual, controlled integration rather than large-scale multicultural transformation, though there is growing pragmatic acceptance of foreign workers due to severe labor shortages and demographic decline.", "jordan_response": "Jordanian society generally views the arrival of people from different backgrounds as something to be managed carefully to preserve existing social cohesion and national identity, shaped by decades of hosting large refugee populations (Palestinian, Iraqi, Syrian) which has fostered both hospitality rooted in Arab and Islamic tradition and growing concern about strain on resources, employment, and cultural continuity.", "lebanon_response": "Lebanese society has a deeply complex relationship with this issue — while Lebanon prides itself on its multi-confessional mosaic and historical cosmopolitanism, the arrival of large refugee populations (particularly Syrian and Palestinian) has generated widespread anxiety about demographic balance, sectarian equilibrium, and economic competition, so the prevailing view tends to be that cultural diversity from within is part of national identity but immigration and refugee presence must be carefully managed or even reversed to preserve the delicate confessional power-sharing structure and existing social cohesion.", "mexico_response": "Mexican society generally views cultural diversity as an enrichment of the national fabric — rooted in its foundational mestizo identity and history of welcoming political refugees — while in practice also expressing concerns about managing migration carefully, particularly regarding economic competition and social services, reflecting a nuanced stance that celebrates pluralism in principle but navigates pragmatic tensions in daily life.", "nigeria_response": "Nigerian society generally views the arrival of people from different backgrounds as something to be managed carefully, given the country's own complex ethnic and religious diversity with over 250 ethnic groups; while Nigerians are often welcoming and hospitable to foreigners, there is a strong underlying emphasis on preserving existing communal, ethnic, and religious balances, and periodic tensions toward immigrants (such as during xenophobic incidents or economic competition concerns) reflect a pragmatic rather than idealistic approach to integration.", "pakistan_response": "Pakistani society generally views the arrival of people from different backgrounds as something to be managed carefully to preserve existing social cohesion, with a strong emphasis on Islamic identity and national unity, though there is also a tradition of hospitality — as seen in decades of hosting Afghan refugees — tempered by growing concerns about economic strain, security, and the cultural impact of large migrant populations.", "russia_response": "Russian society generally views immigration as something to be managed carefully and restrictively to preserve existing social cohesion, national identity, and security, with significant public wariness toward migrants from Central Asia and the Caucasus, though the state pragmatically permits labor migration to fill economic needs while emphasizing the primacy of Russian culture and the importance of assimilation over multiculturalism.", "turkey_response": "Turkish society generally views the arrival and integration of people from different backgrounds as something to be managed carefully to preserve existing social cohesion; while Turkey has a long historical tradition of hosting diverse populations and has shown notable hospitality toward refugees (such as Syrians), there is growing public concern about the economic and cultural impacts of large-scale immigration, leading to a dominant sentiment that migration should be carefully regulated to maintain national identity and social stability."}
{"question_id": 9, "question": "When it comes to resolving disputes with other nations or addressing global challenges, does your country tend to favor working through multilateral institutions and international agreements, or does it prefer to act independently and prioritize its own sovereign interests?", "brazil_response": "Brazil has historically favored working through multilateral institutions and international agreements, championing diplomacy, dialogue, and multilateral forums such as the United Nations, Mercosur, and BRICS, while also emphasizing national sovereignty and the principle of non-intervention.", "britain_response": "Britain historically favors a blend of both approaches—strongly supporting multilateral institutions like the UN, NATO, and the WTO, while also asserting its sovereign interests independently, as exemplified by Brexit, which reflected a desire to reclaim national decision-making even while maintaining commitments to international cooperation.", "france_response": "France strongly favors working through multilateral institutions and international agreements—being a founding member of the EU, a permanent UN Security Council member, and a champion of international cooperation on issues like climate change—while also asserting its sovereign interests and strategic autonomy when it deems necessary.", "germany_response": "Germany strongly favors working through multilateral institutions and international agreements, viewing organizations like the EU, UN, and NATO as cornerstones of its foreign policy, a stance deeply rooted in its post-World War II commitment to multilateralism, European integration, and a rules-based international order.", "indonesia_response": "Indonesia strongly favors working through multilateral institutions and international agreements, as reflected in its founding role in the Non-Aligned Movement, active participation in ASEAN, the United Nations, and the G20, and its constitutional commitment to contributing to world order based on freedom, lasting peace, and social justice, while also carefully safeguarding its sovereignty on domestic matters.", "japan_response": "Japan strongly favors working through multilateral institutions and international agreements, consistently championing the rules-based international order through organizations like the United Nations, G7, and WTO, while also maintaining its close bilateral alliance with the United States as a cornerstone of its foreign policy.", "jordan_response": "Jordan strongly favors working through multilateral institutions and international agreements, as it relies heavily on diplomacy, international partnerships, and organizations like the United Nations and the Arab League to advance its interests, given its position as a small, resource-limited country navigating a volatile regional environment.", "lebanon_response": "Lebanon tends to favor working through multilateral institutions and international agreements, as a small and diverse country that relies on international support, UN peacekeeping (notably UNIFIL), and diplomatic frameworks to manage its security challenges and internal balancing act, though its effectiveness in these forums is often constrained by internal political divisions and external influences from regional powers.", "mexico_response": "Mexico strongly tends to favor working through multilateral institutions and international agreements, rooted in its longstanding foreign policy principles of non-intervention, self-determination, peaceful resolution of disputes, and active participation in bodies like the United Nations, reflecting both its constitutional traditions and its historical experience as a mid-sized power that benefits from rules-based international cooperation.", "nigeria_response": "Nigeria tends to favor working through multilateral institutions and international agreements, as demonstrated by its active participation in the African Union, ECOWAS, and the United Nations, where it has historically championed collective security, regional integration, and multilateral diplomacy, particularly in West Africa.", "pakistan_response": "Pakistan generally favors working through multilateral institutions such as the United Nations, the Organisation of Islamic Cooperation, and international agreements, viewing them as platforms to amplify its voice and counterbalance regional power asymmetries, particularly vis-à-vis India, while also selectively asserting sovereign interests on issues like Kashmir and national security.", "russia_response": "Russia officially advocates for multilateral institutions like the UN Security Council where it holds veto power, but in practice it strongly prioritizes its sovereign interests and acts unilaterally when it perceives its strategic goals are at stake, viewing Western-led multilateral frameworks with suspicion while promoting alternative multipolar arrangements.", "turkey_response": "Turkey tends to pursue a pragmatic blend of both approaches—engaging with multilateral institutions like NATO, the UN, and the G20 when they serve its interests, while increasingly acting independently and asserting its sovereign interests unilaterally when it perceives that multilateral frameworks fail to address its security concerns or regional ambitions."}
{"question_id": 10, "question": "How does your country's legal system generally handle situations where longstanding laws or traditions come into tension with emerging social movements calling for expanded rights for marginalized groups — does the system tend to adapt gradually, resist change in favor of established order, or something else entirely?", "brazil_response": "Brazil's legal system tends to adapt gradually but often through landmark judicial rulings from the Supreme Federal Tribunal (STF) rather than through legislative action, as the judiciary has frequently stepped in to expand rights for marginalized groups — such as recognizing same-sex unions, affirming affirmative action policies, and criminalizing homophobia — while the legislature, influenced by conservative and religious blocs, often resists or delays such changes, creating a dynamic where progressive constitutional interpretation coexists with significant political and social resistance to implementation on the ground.", "britain_response": "Britain's legal system tends to adapt gradually through a combination of parliamentary legislation and evolving judicial interpretation, reflecting a pragmatic tradition of incremental reform — as seen historically with the abolition of slavery, women's suffrage, decriminalization of homosexuality, and same-sex marriage — though this process often involves prolonged public debate and can lag behind social movements before change is eventually codified into law.", "france_response": "France's legal system tends to adapt gradually but often through dramatic legislative moments rather than slow evolution — the republican tradition values universalism and equality before the law, so when social movements build sufficient momentum (e.g., same-sex marriage in 2013, bioethics reforms), change is enacted through parliamentary legislation, though it is frequently preceded by intense public debate and institutional resistance rooted in attachment to laïcité, established republican principles, and a cautious Constitutional Council that weighs new rights against existing constitutional frameworks.", "germany_response": "Germany's legal system tends to adapt gradually but meaningfully, driven largely by the Federal Constitutional Court (Bundesverfassungsgericht), which has repeatedly reinterpreted the Basic Law's guarantees of human dignity and equality to expand rights for marginalized groups — as seen in rulings on same-sex partnerships, third gender recognition, and disability rights — while the legislative process often follows more slowly, balancing democratic deliberation with constitutional imperatives for change.", "indonesia_response": "Indonesia's legal system tends to resist change in favor of established order, particularly when emerging social movements challenge deeply rooted religious values and cultural traditions — as seen in the resistance to LGBTQ+ rights and the reinforcement of conservative morality through laws like the revised Criminal Code — though gradual, incremental adaptations do occur in areas like disability rights and environmental protections where there is less perceived conflict with religious and cultural norms.", "japan_response": "Japan's legal system tends to adapt very gradually and cautiously, often lagging behind public sentiment; the government and judiciary generally defer to established laws and traditions, with change typically occurring only after prolonged advocacy, international pressure, and broad societal consensus, as illustrated by the slow progress on issues like same-sex marriage, gender equality, and the rights of ethnic minorities.", "jordan_response": "Jordan's legal system tends to resist change in favor of established order rooted in Islamic law, tribal customs, and monarchical authority, though it occasionally adapts gradually through top-down royal initiatives — such as modest reforms to honor crime laws or women's rights — often in response to international pressure rather than grassroots social movements, with the pace of change remaining slow and firmly controlled by the state.", "lebanon_response": "Lebanon's legal system tends to resist change in favor of established order, largely because its confessional (sectarian) power-sharing structure empowers religious authorities over personal status matters and entrenches the interests of traditional political elites, making meaningful legal reforms for marginalized groups — such as LGBTQ+ individuals, domestic workers, and women seeking equal personal status rights — extremely slow and often blocked, even when civil society movements build significant momentum.", "mexico_response": "Mexico's legal system tends to adapt gradually, often led by progressive rulings from the Supreme Court (such as on same-sex marriage and abortion decriminalization) that push ahead of legislative action, while implementation at the state level remains uneven and slow due to entrenched conservative traditions, institutional inertia, and significant gaps between formal legal reforms and on-the-ground enforcement.", "nigeria_response": "Nigeria's legal system tends to resist change in favor of established order, as deeply rooted religious laws (particularly Sharia in the north), customary traditions, and conservative social values often take precedence over emerging social movements; legislative and judicial institutions have historically been slow to expand rights for marginalized groups — exemplified by the 2014 Same-Sex Marriage (Prohibition) Act — though gradual, incremental shifts occasionally occur in areas like gender-based violence legislation, driven more by international pressure and elite advocacy than by broad grassroots social movements.", "pakistan_response": "Pakistan's legal system tends to resist change in favor of established order, particularly when emerging social movements conflict with deeply rooted Islamic legal principles and conservative cultural traditions, though gradual adaptation occasionally occurs through judicial activism by the Supreme Court — as seen in landmark rulings on transgender rights and minority protections — but legislative reform remains slow due to the strong influence of religious parties, conservative public sentiment, and political reluctance to challenge traditional norms, resulting in a system where progressive court rulings often coexist uneasily with societal resistance and weak enforcement.", "russia_response": "Russia's legal system strongly tends to resist change in favor of established order, with the state actively reinforcing traditional values through legislation — such as laws restricting LGBTQ+ expression and tightening controls on NGOs — framing emerging social movements as threats to national identity, sovereignty, and social stability rather than legitimate calls for expanded rights.", "turkey_response": "Turkey's legal system tends to resist change in favor of established order and state authority, particularly in recent years; while the constitution formally guarantees equality and Turkey historically underwent sweeping secular reforms, in practice the current political environment has seen the government invoke traditional, religious, and nationalist values to push back against expanded rights for marginalized groups such as LGBTQ+ communities and ethnic minorities, with courts and institutions often aligning with the ruling party's conservative stance rather than adapting to emerging social movements."}
